app/controllers/login_pages_controller.rb

SELECT `login_pages`.* FROM `login_pages`
---
  def index
    @login_pages = LoginPage.all